---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallMeetsRoofTangentially
source: html/5b4f569e-097d-d878-1052-30a3123779a9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.WallMeetsRoofTangentially Property

The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallMeetsRoofTangentially { get; }
```